## Combining and Merging Datasets

- __Data contained in pandas objects can be combined together in a number of ways:__
- __'pandas.merge' connect rows in dataframe base on one or more keys__
- __'pandas.concat' concatenate objects along axis__
- __'combine_first' instance method enable splicing together overlapping data to fill in missing values in one object with values from another.__

### Database-Style DataFrame Joins

- __Merge or join operations combine datasets by linking rows using one or more keys.
These operations are central to relational databases (e.g., SQL-based).__
- __By default merge does an 'inner' join;__

In [2]:
import pandas as pd 

df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)}
                  )
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [5]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)}
                  )
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [7]:
# let's merger the dataframe

pd.merge(df2, df1)

  key  data2  data1
0   a      0      2
1   a      0      4
2   a      0      5
3   b      1      0
4   b      1      1
5   b      1      6

 - __'d' of ''df2' is missed beacuse by defaut merge do the inner join__

- __Note that I didn’t specify which column to join on. If that information is not speci‐
fied, merge uses the overlapping column names as the keys. It’s a good practice to
specify explicitly, though:__

In [8]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

- __If the column names are different in each object, you can specify them separately:__

In [9]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)}
                  )
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [10]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)}
                  )
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [12]:
pd.merge(df3,df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

- __we know that by default merge do inner join, but if you want then we can do other join too__
- __joins are 'inner', 'outer', 'left','right'__

In [14]:
pd.merge(df3,df4, left_on='lkey', right_on='rkey', how='outer')

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

- __right join examples__

In [18]:
pd.merge(df1,df2, on='key', how='right')

  key  data1  data2
0   a    2.0      0
1   a    4.0      0
2   a    5.0      0
3   b    0.0      1
4   b    1.0      1
5   b    6.0      1
6   d    NaN      2

- __To merge with multiple keys, pass a list of column names:__

In [20]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]}
                   )
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [21]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]}
                    )
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [32]:
pd.merge(left,right, on=['key1','key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [33]:
# let's pass another columns name

pd.merge(left,right, left_on='lval',right_on ='rval', how='outer')

  key1_x key2_x  lval key1_y key2_y  rval
0    foo    one   1.0    NaN    NaN   NaN
1    foo    two   2.0    NaN    NaN   NaN
2    bar    one   3.0    NaN    NaN   NaN
3    NaN    NaN   NaN    foo    one   4.0
4    NaN    NaN   NaN    foo    one   5.0
5    NaN    NaN   NaN    bar    one   6.0
6    NaN    NaN   NaN    bar    two   7.0

In [34]:
pd.merge(left,right, how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

- __merge has a suffixes option for specifying strings to append
to overlapping names in the left and right DataFrame objects__

In [1]:
pd.merge(left, right, on='key1', suffixes=('__left', '__right'))

NameError: name 'pd' is not defined

### Merging on Index

- __In some cases, the merge key(s) in a DataFrame will be found in its index.__
- __In this case, you can pass left_index=True or right_index=True (or both) to indicate that the index should be used as the merge key:__

In [40]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)}
                    )
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [41]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, 
                      index=['a', 'b']
                     )
right1

   group_val
a        3.5
b        7.0

In [47]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

- __Another example:-__

In [49]:
import numpy as np

lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio','Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)}
                    )
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [50]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                      index=[
                          ['Nevada', 'Nevada', 'Ohio', 'Ohio','Ohio', 'Ohio'],
                          [2001, 2000, 2000, 2000, 2001, 2002]
                      ],
                      columns=['event1', 'event2']
                     )
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

- __in this case you must indicate multiple columns to merge on as a list__

In [52]:
pd.merge(lefth, righth, left_on = ['key1','key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [53]:
# let's do outer join 

pd.merge(lefth, righth, left_on = ['key1','key2'], right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

- __Using the indexes of both sides of the merge is also possible:__

In [54]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Nevada']
                    )
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [55]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama']
                     )
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [56]:
pd.merge(left2, right2, left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

- __DataFrame has a convenient join instance for merging by index.__
- __It can also be used to combine together many DataFrame objects having the same or similar indexes butnon-overlapping columns__

In [58]:
left2.join(right2, how='inner')

   Ohio  Nevada  Missouri  Alabama
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

### Concatenating Along an Axis

- __Another kind of data combination operation is referred to interchangeably as concatenation, binding, or stacking__
- __Numpy's concatenate function can do this with Numpy arrays__

In [2]:
import numpy as np
import pandas as pd

In [3]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [6]:
# concatenate array

np.concatenate([arr,arr])

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [9]:
# concatenate array alsong axis

np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

- __The concat function in pandas provides a consistent way to address each of these
concerns__

In [10]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [16]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

- __By default concat works along axis=0, producing another seris__
- __If you pass axis=1, the result will instead be DataFrame__

In [17]:
pd.concat([s1,s2,s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

- __In these case there is no overlap on the other axis, so we can do this__

In [21]:
pd.concat([s1,s2])

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [22]:
pd.concat([s1,s2],axis=1)

     0    1
a  0.0  NaN
b  1.0  NaN
c  NaN  2.0
d  NaN  3.0
e  NaN  4.0

- __in the above the 'f' and 'g' label dissapeared beacuse of the join ='inner' option__
- __you can even specify the axes to be used on the other axes with join_axes__

In [32]:
pd.concat([s1,s2],axis=1)

     0    1
a  0.0  NaN
b  1.0  NaN
c  NaN  2.0
d  NaN  3.0
e  NaN  4.0

In [33]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [35]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [36]:
 pd.concat([s1, s1, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  0.0    NaN
b  1.0  1.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

- __The same logic extends to DataFrame objects:__

In [37]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), 
                   index=['a', 'b', 'c'],
                   columns=['one', 'two']
                  )
df1

   one  two
a    0    1
b    2    3
c    4    5

In [38]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), 
                   index=['a', 'c'],
                   columns=['three', 'four']
                  )
df2

   three  four
a      5     6
c      7     8

In [42]:
pd.concat([df1,df2], axis=1,  keys = ['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

 - __If you pass a dict of objects instead of a list, the dict’s keys will be used for the keys
option:__

In [44]:
pd.concat({'level1' : df1, 'level2' : df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

- __There are additional arguments governing how the hierarchical index is created__

In [46]:
pd.concat([df1,df2], axis=1,  keys = ['level1', 'level2'], names = ['upper','lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

- __A last consideration concerns DataFrames in which the row index does not contain
any relevant data:__

In [47]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df1

          a         b         c         d
0 -0.690651 -0.323978 -0.031502 -0.270167
1  1.035449  0.316359 -0.987276  2.884972
2 -0.150468 -1.568994  1.539600 -0.298273

In [48]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
df2

          b         d         a
0 -1.144358  0.144973 -0.445431
1 -0.424183 -1.467989  1.178616

- __In this case, you can pass ignore_index=True :__

In [49]:

pd.concat([df1, df2], ignore_index = True)

          a         b         c         d
0 -0.690651 -0.323978 -0.031502 -0.270167
1  1.035449  0.316359 -0.987276  2.884972
2 -0.150468 -1.568994  1.539600 -0.298273
3 -0.445431 -1.144358       NaN  0.144973
4  1.178616 -0.424183       NaN -1.467989

### Combining Data with Overlap

- __There is another data combination situation that can't be expressed as either a merge or concatenation operation__
- __You may have two datasets whose indexes overlap in full or part__
- __As a motivating example, consider NumPy’s where function, which performs the array-oriented equivalent of an if-else expression__

In [50]:
df_1 = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
              index=['f', 'e', 'd', 'c', 'b', 'a']
             )
df_1

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [52]:
df_2 = pd.Series(np.arange(len(df_1), dtype=np.float64),
              index=['f', 'e', 'd', 'c', 'b', 'a']
             )
df_2

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [53]:
np.where(pd.isnull(df_1), df_2, df_1)

array([0. , 2.5, 2. , 3.5, 4.5, 5. ])

- __Series has a 'combine_first' method, which performs the equivalent of this operation
along with pandas’s usual data alignment logic:__

In [54]:
df_2[:-2].combine_first(df_1[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [55]:
df_1.combine_first(df_1)

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

# Concatenating Along an Axis